
const 平仮名 = {
    "あ系": [
        "あ", "い", "う", "え", "お",
        "か", "き", "く", "け", "こ",
        "さ", "し", "す", "せ", "そ",
        "た", "ち", "つ", "て", "と",
        "な", "に", "ぬ", "ね", "の",
        "は", "ひ", "ふ", "へ", "ほ",
        "ま", "み", "む", "め", "も",
        "や", "ゆ", "よ",
        "ら", "り", "る", "れ", "ろ",
        "わ"
    ],
    "ぱ行": ["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"],
    "きゃ系": [
        "きゃ", "きゅ", "きょ",
        "しゃ", "しゅ", "しょ",
        "ちゃ", "ちゅ", "ちょ",
        "にゃ", "にゅ", "にょ",
        "ひゃ", "ひゅ", "ひょ",
        "みゃ", "みゅ", "みょ",
        "りゃ", "りゅ", "りょ",
    ],
    "ぴゃ行": ["ぴゃ", "ぴゅ", "ぴょ"]
};

function 平仮名一覧(type = "清音") {
    let result = [];
    switch (type) {
        case "清音":
            result = Array.from(平仮名.あ系);
            break;
        case "特殊":
            result = Array.from(平仮名.ぱ行);
            result = result.concat(平仮名.きゃ系);
            result = result.concat(平仮名.ぴゃ行);
            break;
        case "全部":
            result = Array.from(平仮名.あ系);
            result = result.concat(平仮名.ぱ行);
            result = result.concat(平仮名.きゃ系);
            result = result.concat(平仮名.ぴゃ行);
            break;
    }
    return result;
}

const 速記文字一覧 = {
    "あ": "&#xF7A0;",
    "い": "&#xF7A1;",
    "う": "&#xF7A2;",
    "え": "&#xF7A3;",
    "お": "&#xF7A4;",

    "か": "&#xF7A5;",
    "き": "&#xF7A6;",
    "く": "&#xF7A7;",
    "け": "&#xF7A8;",
    "こ": "&#xF7A9;",

    "さ": "&#xF7AA;",
    "し": "&#xF7AB;",
    "す": "&#xF7AC;",
    "せ": "&#xF7AD;",
    "そ": "&#xF7AE;",

    "た": "&#xF7AF;",
    "ち": "&#xF7B0;",
    "つ": "&#xF7B1;",
    "て": "&#xF7B2;",
    "と": "&#xF7B3;",

    "な": "&#xF7B4;",
    "に": "&#xF7B5;",
    "ぬ": "&#xF7B6;",
    "ね": "&#xF7B7;",
    "の": "&#xF7B8;",

    "は": "&#xF7B9;",
    "ひ": "&#xF7BA;",
    "ふ": "&#xF7BB;",
    "へ": "&#xF7BC;",
    "ほ": "&#xF7BD;",

    "ま": "&#xF7BE;",
    "み": "&#xF7BF;",
    "む": "&#xF7C0;",
    "め": "&#xF7C1;",
    "も": "&#xF7C2;",

    "や": "&#xF7C3;",
    "ゆ": "&#xF7C4;",
    "よ": "&#xF7C5;",

    "ら": "&#xF7C6;",
    "り": "&#xF7C7;",
    "る": "&#xF7C8;",
    "れ": "&#xF7C9;",
    "ろ": "&#xF7CA;",

    "わ": "&#xF7CB;",
    // "ゐ": "&#xF7CC;",
    // "ゑ": "&#xF7CD;",
    // "を": "&#xF7CE;", // 一般的に「お」を使う

    "ぱ": "&#xF7CF;",
    "ぴ": "&#xF7D0;",
    "ぷ": "&#xF7D1;",
    "ぺ": "&#xF7D2;",
    "ぽ": "&#xF7D3;",

    "きゃ": "&#xF7D4;",
    "きゅ": "&#xF7D5;",
    "きょ": "&#xF7D6;",

    // "くぁ": "&#xF7D7;",
    // "くぃ": "&#xF7D8;",
    // "くぇ": "&#xF7D9;",
    // "くぉ": "&#xF7DA;",

    "しゃ": "&#xF7DB;",
    "しゅ": "&#xF7DC;",
    "しぇ": "&#xF7DD;",
    "しょ": "&#xF7DE;",

    "ちゃ": "&#xF7DF;",
    "ちゅ": "&#xF7E0;",
    "ちぇ": "&#xF7E1;",
    "ちょ": "&#xF7E2;",

    // "ち": "&#xF7E3;", // 「&#xF7B0;」で代替

    // "ちゅ": "&#xF7E4;", // 「&#xF7E0;」で代替

    "にゃ": "&#xF7E5;",
    "にゅ": "&#xF7E6;",
    "にょ": "&#xF7E7;",
    
    "ひゃ": "&#xF7E8;",
    "ひゅ": "&#xF7E9;",
    "ひょ": "&#xF7EA;",

    // "ふぁ": "&#xF7EB;",
    // "ふぃ": "&#xF7EC;",
    // "ふゅ": "&#xF7ED;",
    // "ふぇ": "&#xF7EE;",
    // "ふぉ": "&#xF7EF;",

    "みゃ": "&#xF7F0;",
    "みゅ": "&#xF7F1;",
    "みょ": "&#xF7F2;",

    // "いぇ": "&#xF7F3;",

    "りゃ": "&#xF7F4;",
    "りゅ": "&#xF7F5;",
    "りょ": "&#xF7F6;",

    "ぴゃ": "&#xF7F7;",
    "ぴゅ": "&#xF7F8;",
    "ぴょ": "&#xF7F9;",

    // "ヴぁ": "&#xF7FA;",
    // "ヴぃ": "&#xF7FB;",
    // "ヴぇ": "&#xF7FC;",
    // "ヴぉ": "&#xF7FD;",
};

// debug用
function 速記文字変換(平仮名配列) {
    return 平仮名配列.map(h => 速記文字一覧[h]).join("");
}

